package com.ren.tarena.xiaohua.entity;

import java.util.List;

/**
 * Created by Renshaobo on 2017/6/11.
 */

public class Tuijian {

    /**
     * showapi_res_code : 0
     * showapi_res_error :
     * showapi_res_body : {"allPages":325,"ret_code":0,"contentlist":[{"title":"在公司上班，需要穿工...","text":"在公司上班，需要穿工作服，有一次忘记带了，就没穿，\r\n中午去食堂吃饭，打饭的阿姨给我打了满满一盘菜，比三人份还多，\r\n我瞬间震惊了，同事说，你没穿工作服，人家拿你当领导了\u2026\u2026","type":1,"ct":"2017-06-17 13:30:22.248"},{"title":"一个说话有浓重口音的...","text":"一个说话有浓重口音的老师问一学生：\u201c50+9=？\u201d\r\n学生想了半天才答道：\u201c武术+酒=醉拳。\u201d","type":1,"ct":"2017-06-17 13:18:49.068"},{"title":"男子半夜潜入一户有钱...","text":"男子半夜潜入一户有钱人家，用木棍把男主人击晕，\r\n然后进行了疯狂的飘荡，准备离开时，\r\n突然听见浴室里喊道：\u201c我洗好了，你进来吧！\u201d\r\n于是男子动了邪念，冲进了浴室，\r\n男子永远都忘不了，浴室里，自己的老婆看到他的惊讶表情。","type":1,"ct":"2017-06-17 13:18:48.707"},{"title":"\u201c听说你们腐女就爱自...","text":"\u201c听说你们腐女就爱自己脑补妄想，官方主动卖腐你们反而会失去兴趣，这是为什么呢？\u201d\r\n\u201c你想象一下，一个女高中生把裙子撩过头顶高喊着\u2018大爷快看啊！看啊！看个够啊！\u2019向你狂奔过来，你会有兴趣么？\u201d\r\n\u201c哦。。。\u201d","type":1,"ct":"2017-06-17 13:18:48.697"},{"title":"从前有一个村庄，村子...","text":"从前有一个村庄，村子旁有一条大河，波浪宽。河中有一个怪物，每周都要到村子吃一个处女。\r\n后来，一个名勇士路过村庄，听说了这件事便要杀死怪物，可就是打不过，于是勇士想了一个主意，最后，那个怪物饿死了，","type":1,"ct":"2017-06-17 12:30:07.000"},{"title":"在快餐店看到一个超好...","text":"在快餐店看到一个超好看的外国小男孩，大眼睛长睫毛，一头柔软的小卷发，穿着个T恤，胸前还写着\u201c大哥\u201d两个字，萌到不行。\r\n我便四处寻找他的弟弟妹妹，想看看是不是也穿着\u201c二哥\u201d、\u201c小妹\u201d什么的，却只见他爸端着盘子走过来，一个1米90多白人大汉，穿一件勒得紧紧的T恤，胸前写着\u201c马仔\u201d两个字。","type":1,"ct":"2017-06-17 12:30:06.618"},{"title":"这辈子都不想要小孩了...","text":"这辈子都不想要小孩了嗷！！！\r\n昨天周末公司集体加班！同事把小孩带来公司！\r\n乖倒是挺乖的！只会一个人在那儿画画！\r\n当着所有人的面一共只和我说了三句话，\r\n分别是：\u201c阿姨你怎么不长奶奶？\u201d、\u201c阿姨你怎么有胡子啊？\u201d、\u201c阿姨你的毛线裤露出来了。\u201d\r\n小屁孩我cnmb！！","type":1,"ct":"2017-06-17 12:19:21.087"},{"title":"某次男生宿舍关灯后，...","text":"某次男生宿舍关灯后，男生集体大喊\u201c来电！来电！\u201d后真的来电；\r\n接着，男生宿舍集体高喊\u201c晚点熄灯！晚点熄灯！\u201d然后真的11:50才熄灯；\r\n最后，男生宿舍集体高叫\u201c女人！女人！\u2026\u2026\u201d","type":1,"ct":"2017-06-17 12:19:21.062"},{"text":"室友小萌因为生理痛，在沙发上蜷成一团，我递热水过去的时候她整个人都在哆嗦，问她有没有事，只见她两眼发直冷汗直流，非常入戏地从牙缝中挤出一句：\u201c\u2026\u2026泼猴，死心吧！我不会把芭蕉扇借给你的\u2026\u2026！\u201d","title":"泼猴，死心吧","type":1,"ct":"2017-06-17 12:19:21.051"},{"title":"女同事相亲，她身高1...","text":"女同事相亲，她身高177，给对方报的175，然后对方173，也给这姑娘报的175，于是两个身高\u201c一样\u201d的人见面了。","type":1,"ct":"2017-06-17 11:30:06.537"},{"title":"你们每次骂别人时，有...","text":"你们每次骂别人时，有没有考虑过对方的感受？\r\n反正我是有，尽量不用方言，怕对方听不懂。","type":1,"ct":"2017-06-17 11:30:06.321"},{"title":"小侄女在iPad上玩...","text":"小侄女在iPad上玩植物大战僵尸，就干两件事情，收太阳，种土豆给僵尸吃，她认为这个游戏是在养僵尸。。","type":1,"ct":"2017-06-17 11:16:18.222"},{"title":"今天在古玩店买了一个...","text":"今天在古玩店买了一个明朝的花瓶，回家一看底下还有二维码，用手机一扫，结果显示是唐朝的，我真TM赚翻了！！","type":1,"ct":"2017-06-17 11:16:18.216"},{"title":"       女性好...","text":"       女性好友生日，我们四个人商量零点发一条\u201c生日快乐\u201d给她，一人发一个字，我领到了第二个。。。结果，他们都没发。。。。。","type":1,"ct":"2017-06-17 10:13:15.381"},{"title":"\u201d我谈过很多恋爱，前...","text":"\u201d我谈过很多恋爱，前任对我很好，可跟前前任和前前前任比又是个穷逼，不过我心里最爱的还是才华横溢的前前前前任，但最近最帅的前前前前前任又找我复合\u2026哎\u2026\u201d\r\n\u201c姑娘，你不说话，没人当你是结巴。\u201d","type":1,"ct":"2017-06-17 09:30:20.559"},{"text":"偶一次指着西瓜说：\u201c要一半的一半\u2026\u2026的一半\u2026\u2026\u201d　　(还很是思考了一会儿，怕少说一个，没钱付账的说。)　　师傅挥刀曰：\u201c八分之一是吧？\u201d　　不知道师傅有没有受打击。反正偶是受打击了。","title":"八分之一","type":1,"ct":"2017-06-17 09:30:20.482"},{"text":"俺们那年献血的时候，某位仁兄同医生的对话，呵呵。　　大夫：同学，请把胳膊弯一下。　　同学：弯曲角度是多少？　　大夫：\u2026\u2026　　大夫：同学，请把手一握一放。　　同学：频率是多少？","title":"献血","type":1,"ct":"2017-06-17 09:30:20.482"},{"text":"我父母是医生，周围的叔叔阿姨都是大夫。　　有一次，一个阿姨去买菜，对卖肉的大师傅说：\u201c师傅，来一个猪肾。\u201d　　搞得师傅一头雾水，没有理他。这个旁边过来一个人说：\u201c这个腰子我要了。\u201d　　于是，肉摊上剩下的唯一只猪腰子，被人抢走了。　　阿姨郁闷不已。","title":"猪肾","type":1,"ct":"2017-06-17 09:30:20.438"},{"text":"一次在清华食堂吃饭，对面坐了两个女生，听到一位对另一位说：\u201c我还没吃饱，想再吃一点儿。\u201d　　另一位说：\u201c你要什么？我去买。\u201d前一女生说：\u201c就是那种扇形锐角饼，你帮再我买两块儿。\u201d　　我暗想：清华女生确实不一样，我们平时只是称那种饼为三角饼。","title":"扇形锐角饼","type":1,"ct":"2017-06-17 09:30:20.437"},{"text":"第一次去十食堂吃龙须面，之前只看过别人吃得香喷喷，不知道它叫什么名字，就跟那个师傅说：\u201c师傅，那种面条直径比较细，大概不超过2毫米，然后还放了两个二分之一的煮熟的鸡蛋，汤里还有\u2026\u2026\u201d我正想说\u201c绿色的叶子状的东东\u201d。　　师傅就说：\u201c打卡吧！\u201d　　可我一看就一块五，感觉龙须面不应该这么便宜，就重复了一下：\u201c师傅，我要的是那种\u2026\u2026\u201d　　\u201c行了行了，龙须面嘛，我听懂了！\u201d","title":"龙须面","type":1,"ct":"2017-06-17 09:30:20.437"}],"currentPage":1,"allNum":6492,"maxResult":20}
     */

    private int showapi_res_code;
    private String showapi_res_error;
    private ShowapiResBodyBean showapi_res_body;

    public int getShowapi_res_code() {
        return showapi_res_code;
    }

    public void setShowapi_res_code(int showapi_res_code) {
        this.showapi_res_code = showapi_res_code;
    }

    public String getShowapi_res_error() {
        return showapi_res_error;
    }

    public void setShowapi_res_error(String showapi_res_error) {
        this.showapi_res_error = showapi_res_error;
    }

    public ShowapiResBodyBean getShowapi_res_body() {
        return showapi_res_body;
    }

    public void setShowapi_res_body(ShowapiResBodyBean showapi_res_body) {
        this.showapi_res_body = showapi_res_body;
    }

    public static class ShowapiResBodyBean {
        /**
         * allPages : 325
         * ret_code : 0
         * contentlist : [{"title":"在公司上班，需要穿工...","text":"在公司上班，需要穿工作服，有一次忘记带了，就没穿，\r\n中午去食堂吃饭，打饭的阿姨给我打了满满一盘菜，比三人份还多，\r\n我瞬间震惊了，同事说，你没穿工作服，人家拿你当领导了\u2026\u2026","type":1,"ct":"2017-06-17 13:30:22.248"},{"title":"一个说话有浓重口音的...","text":"一个说话有浓重口音的老师问一学生：\u201c50+9=？\u201d\r\n学生想了半天才答道：\u201c武术+酒=醉拳。\u201d","type":1,"ct":"2017-06-17 13:18:49.068"},{"title":"男子半夜潜入一户有钱...","text":"男子半夜潜入一户有钱人家，用木棍把男主人击晕，\r\n然后进行了疯狂的飘荡，准备离开时，\r\n突然听见浴室里喊道：\u201c我洗好了，你进来吧！\u201d\r\n于是男子动了邪念，冲进了浴室，\r\n男子永远都忘不了，浴室里，自己的老婆看到他的惊讶表情。","type":1,"ct":"2017-06-17 13:18:48.707"},{"title":"\u201c听说你们腐女就爱自...","text":"\u201c听说你们腐女就爱自己脑补妄想，官方主动卖腐你们反而会失去兴趣，这是为什么呢？\u201d\r\n\u201c你想象一下，一个女高中生把裙子撩过头顶高喊着\u2018大爷快看啊！看啊！看个够啊！\u2019向你狂奔过来，你会有兴趣么？\u201d\r\n\u201c哦。。。\u201d","type":1,"ct":"2017-06-17 13:18:48.697"},{"title":"从前有一个村庄，村子...","text":"从前有一个村庄，村子旁有一条大河，波浪宽。河中有一个怪物，每周都要到村子吃一个处女。\r\n后来，一个名勇士路过村庄，听说了这件事便要杀死怪物，可就是打不过，于是勇士想了一个主意，最后，那个怪物饿死了，","type":1,"ct":"2017-06-17 12:30:07.000"},{"title":"在快餐店看到一个超好...","text":"在快餐店看到一个超好看的外国小男孩，大眼睛长睫毛，一头柔软的小卷发，穿着个T恤，胸前还写着\u201c大哥\u201d两个字，萌到不行。\r\n我便四处寻找他的弟弟妹妹，想看看是不是也穿着\u201c二哥\u201d、\u201c小妹\u201d什么的，却只见他爸端着盘子走过来，一个1米90多白人大汉，穿一件勒得紧紧的T恤，胸前写着\u201c马仔\u201d两个字。","type":1,"ct":"2017-06-17 12:30:06.618"},{"title":"这辈子都不想要小孩了...","text":"这辈子都不想要小孩了嗷！！！\r\n昨天周末公司集体加班！同事把小孩带来公司！\r\n乖倒是挺乖的！只会一个人在那儿画画！\r\n当着所有人的面一共只和我说了三句话，\r\n分别是：\u201c阿姨你怎么不长奶奶？\u201d、\u201c阿姨你怎么有胡子啊？\u201d、\u201c阿姨你的毛线裤露出来了。\u201d\r\n小屁孩我cnmb！！","type":1,"ct":"2017-06-17 12:19:21.087"},{"title":"某次男生宿舍关灯后，...","text":"某次男生宿舍关灯后，男生集体大喊\u201c来电！来电！\u201d后真的来电；\r\n接着，男生宿舍集体高喊\u201c晚点熄灯！晚点熄灯！\u201d然后真的11:50才熄灯；\r\n最后，男生宿舍集体高叫\u201c女人！女人！\u2026\u2026\u201d","type":1,"ct":"2017-06-17 12:19:21.062"},{"text":"室友小萌因为生理痛，在沙发上蜷成一团，我递热水过去的时候她整个人都在哆嗦，问她有没有事，只见她两眼发直冷汗直流，非常入戏地从牙缝中挤出一句：\u201c\u2026\u2026泼猴，死心吧！我不会把芭蕉扇借给你的\u2026\u2026！\u201d","title":"泼猴，死心吧","type":1,"ct":"2017-06-17 12:19:21.051"},{"title":"女同事相亲，她身高1...","text":"女同事相亲，她身高177，给对方报的175，然后对方173，也给这姑娘报的175，于是两个身高\u201c一样\u201d的人见面了。","type":1,"ct":"2017-06-17 11:30:06.537"},{"title":"你们每次骂别人时，有...","text":"你们每次骂别人时，有没有考虑过对方的感受？\r\n反正我是有，尽量不用方言，怕对方听不懂。","type":1,"ct":"2017-06-17 11:30:06.321"},{"title":"小侄女在iPad上玩...","text":"小侄女在iPad上玩植物大战僵尸，就干两件事情，收太阳，种土豆给僵尸吃，她认为这个游戏是在养僵尸。。","type":1,"ct":"2017-06-17 11:16:18.222"},{"title":"今天在古玩店买了一个...","text":"今天在古玩店买了一个明朝的花瓶，回家一看底下还有二维码，用手机一扫，结果显示是唐朝的，我真TM赚翻了！！","type":1,"ct":"2017-06-17 11:16:18.216"},{"title":"       女性好...","text":"       女性好友生日，我们四个人商量零点发一条\u201c生日快乐\u201d给她，一人发一个字，我领到了第二个。。。结果，他们都没发。。。。。","type":1,"ct":"2017-06-17 10:13:15.381"},{"title":"\u201d我谈过很多恋爱，前...","text":"\u201d我谈过很多恋爱，前任对我很好，可跟前前任和前前前任比又是个穷逼，不过我心里最爱的还是才华横溢的前前前前任，但最近最帅的前前前前前任又找我复合\u2026哎\u2026\u201d\r\n\u201c姑娘，你不说话，没人当你是结巴。\u201d","type":1,"ct":"2017-06-17 09:30:20.559"},{"text":"偶一次指着西瓜说：\u201c要一半的一半\u2026\u2026的一半\u2026\u2026\u201d　　(还很是思考了一会儿，怕少说一个，没钱付账的说。)　　师傅挥刀曰：\u201c八分之一是吧？\u201d　　不知道师傅有没有受打击。反正偶是受打击了。","title":"八分之一","type":1,"ct":"2017-06-17 09:30:20.482"},{"text":"俺们那年献血的时候，某位仁兄同医生的对话，呵呵。　　大夫：同学，请把胳膊弯一下。　　同学：弯曲角度是多少？　　大夫：\u2026\u2026　　大夫：同学，请把手一握一放。　　同学：频率是多少？","title":"献血","type":1,"ct":"2017-06-17 09:30:20.482"},{"text":"我父母是医生，周围的叔叔阿姨都是大夫。　　有一次，一个阿姨去买菜，对卖肉的大师傅说：\u201c师傅，来一个猪肾。\u201d　　搞得师傅一头雾水，没有理他。这个旁边过来一个人说：\u201c这个腰子我要了。\u201d　　于是，肉摊上剩下的唯一只猪腰子，被人抢走了。　　阿姨郁闷不已。","title":"猪肾","type":1,"ct":"2017-06-17 09:30:20.438"},{"text":"一次在清华食堂吃饭，对面坐了两个女生，听到一位对另一位说：\u201c我还没吃饱，想再吃一点儿。\u201d　　另一位说：\u201c你要什么？我去买。\u201d前一女生说：\u201c就是那种扇形锐角饼，你帮再我买两块儿。\u201d　　我暗想：清华女生确实不一样，我们平时只是称那种饼为三角饼。","title":"扇形锐角饼","type":1,"ct":"2017-06-17 09:30:20.437"},{"text":"第一次去十食堂吃龙须面，之前只看过别人吃得香喷喷，不知道它叫什么名字，就跟那个师傅说：\u201c师傅，那种面条直径比较细，大概不超过2毫米，然后还放了两个二分之一的煮熟的鸡蛋，汤里还有\u2026\u2026\u201d我正想说\u201c绿色的叶子状的东东\u201d。　　师傅就说：\u201c打卡吧！\u201d　　可我一看就一块五，感觉龙须面不应该这么便宜，就重复了一下：\u201c师傅，我要的是那种\u2026\u2026\u201d　　\u201c行了行了，龙须面嘛，我听懂了！\u201d","title":"龙须面","type":1,"ct":"2017-06-17 09:30:20.437"}]
         * currentPage : 1
         * allNum : 6492
         * maxResult : 20
         */

        private int allPages;
        private int ret_code;
        private int currentPage;
        private int allNum;
        private int maxResult;
        private List<ContentlistBean> contentlist;

        public int getAllPages() {
            return allPages;
        }

        public void setAllPages(int allPages) {
            this.allPages = allPages;
        }

        public int getRet_code() {
            return ret_code;
        }

        public void setRet_code(int ret_code) {
            this.ret_code = ret_code;
        }

        public int getCurrentPage() {
            return currentPage;
        }

        public void setCurrentPage(int currentPage) {
            this.currentPage = currentPage;
        }

        public int getAllNum() {
            return allNum;
        }

        public void setAllNum(int allNum) {
            this.allNum = allNum;
        }

        public int getMaxResult() {
            return maxResult;
        }

        public void setMaxResult(int maxResult) {
            this.maxResult = maxResult;
        }

        public List<ContentlistBean> getContentlist() {
            return contentlist;
        }

        public void setContentlist(List<ContentlistBean> contentlist) {
            this.contentlist = contentlist;
        }

        public static class ContentlistBean {
            /**
             * title : 在公司上班，需要穿工...
             * text : 在公司上班，需要穿工作服，有一次忘记带了，就没穿，
             中午去食堂吃饭，打饭的阿姨给我打了满满一盘菜，比三人份还多，
             我瞬间震惊了，同事说，你没穿工作服，人家拿你当领导了……
             * type : 1
             * ct : 2017-06-17 13:30:22.248
             */

            private String title;
            private String text;
            private int type;
            private String ct;

            public String getTitle() {
                return title;
            }

            public void setTitle(String title) {
                this.title = title;
            }

            public String getText() {
                return text;
            }

            public void setText(String text) {
                this.text = text;
            }

            public int getType() {
                return type;
            }

            public void setType(int type) {
                this.type = type;
            }

            public String getCt() {
                return ct;
            }

            public void setCt(String ct) {
                this.ct = ct;
            }
        }
    }
}
